STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_lcd.c
/**
  ******************************************************************************
  * @file    stm32mp257f_eval_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on STM32MP257F-EV board.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  1. How To use this driver:
  --------------------------
     - This driver provides basic UI API's to draw Rectangle , Bitmap , Draw ASCII character, Horizontal line
        Vertical Line along with configuration functions.

  2. Driver description:
  ---------------------
    + Initialization steps:
       o Set Active Layer by BSP_LCD_SelectLayer(), LTDC controller support upto 3 layer
       o Synchronize the Pixel Format between utility and driver using  BSP_LCD_GetLTDCPixelFormat()

    + Options
       o Configure and enable the color keying functionality using the
         BSP_LCD_SetColorKeying() function.
       o Modify in the fly the transparency and/or the frame buffer address
         using the following functions:
         - BSP_LCD_SetTransparency()
         - BSP_LCD_SetLayerAddress()
  @endverbatim
  */

/* Dependencies
- stm32mp257f_eval.c
- Components/Common/lcd.c
- fonts.h
- font24.c
- font20.c
- font16.c
- font12.c
- font8.c"
EndDependencies */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp257f_eval_lcd.h"


/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP257F_EV1
  * @{
  */

/** @addtogroup LCD
  * @{
  */

/** @defgroup LCD_Private_TypesDefinitions STM32MP257F_EV1 LCD Private Types Definitions
  * @{
  */
const LCD_UTILS_Drv_t LCD_Driver =
{
  BSP_LCD_DrawBitmap,
  BSP_LCD_FillRGBRect,
  BSP_LCD_DrawHLine,
  BSP_LCD_DrawVLine,
  BSP_LCD_FillRect,
  BSP_LCD_ReadPixel,
  BSP_LCD_WritePixel,
  BSP_LCD_GetXSize,
  BSP_LCD_GetYSize,
  BSP_LCD_SelectLayer,
  BSP_LCD_GetPixelFormat

};
/**
  * @}
  */
/** @defgroup LCD_Private_Defines LCD Private Defines
  * @{
  */
#define POLY_X(Z)              ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)              ((int32_t)((Points + Z)->Y))
#define PIXEL_PER_LINE         (1024*2)
#define ALPHA_VALUE             255
/**
  * @}
  */

/** @defgroup LCD_Private_Macros LCD Private Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))
/**
  * @}
  */

/** @defgroup LCD_Private_Variables LCD Private Variables
  * @{
  */
LTDC_HandleTypeDef  hLtdcHandler;

/* Default LCD configuration with LCD Layer 1 */
static uint32_t            ActiveLayer = 0;
static LCD_DrawPropTypeDef DrawProp[MAX_LAYER_NUMBER];
/**
  * @}
  */

/** @defgroup LCD_Private_FunctionPrototypes LCD Private Function Prototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup LCD_Exported_Functions LCD Exported Functions
  * @{
  */

/**
  * @brief  Gets the LCD X size.
  * @param  Instance LCD Instance
  * @retval XSize pointer Used LCD X size
  */
int32_t BSP_LCD_GetXSize(uint32_t Instance, uint32_t *XSize)
{

  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    *XSize = hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth;
  }

  return ret;
}

/**
  * @brief  Gets the LCD Y size.
  * @param  Instance LCD Instance
  * @retval YSize pointer Used LCD Y size
  */
int32_t BSP_LCD_GetYSize(uint32_t Instance, uint32_t *YSize)
{

  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    *YSize = hLtdcHandler.LayerCfg[ActiveLayer].ImageHeight;
  }

  return ret;
}

/**
  * @brief  Set the LCD X size.
  * @param  Instance    LCD Instance
  * @param  imageWidthPixels : image width in pixels unit
  * @retval None
  */
int32_t BSP_LCD_SetXSize(uint32_t Instance, uint32_t imageWidthPixels)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth = imageWidthPixels;
  }
  return ret;
}

/**
  * @brief  Set the LCD Y size.
  * @param  Instance    LCD Instance
  * @param  imageHeightPixels : image height in lines unit
  * @retval None
  */
int32_t BSP_LCD_SetYSize(uint32_t Instance, uint32_t imageHeightPixels)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    hLtdcHandler.LayerCfg[ActiveLayer].ImageHeight = imageHeightPixels;
  }
  return ret;

}


/**
  * @brief  Selects the LCD Layer.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @retval None
  */
int32_t BSP_LCD_SelectLayer(uint32_t Instance, uint32_t LayerIndex)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ActiveLayer = LayerIndex;
  }
  return ret;
}

/**
  * @brief  Sets an LCD Layer visible
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Visible Layer
  * @param  State: New state of the specified layer
  *          This parameter can be one of the following values:
  *            @arg  ENABLE
  *            @arg  DISABLE
  * @retval None
  */
int32_t BSP_LCD_SetLayerVisible(uint32_t Instance, uint32_t LayerIndex, FunctionalState State)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (State == ENABLE)
    {
      __HAL_LTDC_LAYER_ENABLE(&hLtdcHandler, LayerIndex);
    }
    else
    {
      __HAL_LTDC_LAYER_DISABLE(&hLtdcHandler, LayerIndex);
    }
    __HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(&hLtdcHandler);
  }
  return ret;
}

/**
  * @brief  Sets an LCD Layer visible without reloading.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Visible Layer
  * @param  State: New state of the specified layer
  *          This parameter can be one of the following values:
  *            @arg  ENABLE
  *            @arg  DISABLE
  * @retval None
  */
int32_t BSP_LCD_SetLayerVisible_NoReload(uint32_t Instance, uint32_t LayerIndex, FunctionalState State)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (State == ENABLE)
    {
      __HAL_LTDC_LAYER_ENABLE(&hLtdcHandler, LayerIndex);
    }
    else
    {
      __HAL_LTDC_LAYER_DISABLE(&hLtdcHandler, LayerIndex);
    }
  }
  return ret;
  /* Do not Sets the Reload  */
}

/**
  * @brief  Gets the LCD Active LCD Pixel Format.
  * @param  Instance    LCD Instance
  * @param  PixelFormat Active LCD Pixel Format
  * @retval BSP status
  */
int32_t BSP_LCD_GetPixelFormat(uint32_t Instance, uint32_t *PixelFormat)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t LCDPixelFormat;
    BSP_LCD_GetLCDPixelFormat(Instance, hLtdcHandler.LayerCfg[ActiveLayer].PixelFormat, &LCDPixelFormat);
    *PixelFormat = LCDPixelFormat;
  }

  return ret;
}
/**
  * @brief  Gets the LCD Active LTDC Pixel Format.
  * @param  Instance    LCD Instance
  * @param  PixelFormat Active LCD Pixel Format
  * @param  LTDCPixelFormat Pointer to Active LTDC Pixel Format
  * @retval BSP status
  */
int32_t BSP_LCD_GetLTDCPixelFormat(uint32_t Instance, uint32_t PixelFormat, uint32_t *LTDCPixelFormat)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {

