STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_lcd.c
  }
  return ret;
}

/**
  * @brief  Draws a full rectangle in currently active layer.
  * @param  Instance   LCD Instance
  * @param  Xpos X position
  * @param  Ypos Y position
  * @param  Width Rectangle width
  * @param  Height Rectangle height
  * @param  Color RGB color
  * @retval BSP status
  */
int32_t BSP_LCD_FillRect(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Width, uint32_t Height,
                         uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t ref = Ypos + Height;
    /* Write line */
    while (Ypos < ref)
    {
      ret = BSP_LCD_DrawHLine(Instance, Xpos, Ypos++, Width, Color);
    }
  }
  return ret;
}

/**
  * @brief  Draws an horizontal line in currently active layer.
  * @param  Instance   LCD Instance
  * @param  Xpos  X position
  * @param  Ypos  Y position
  * @param  Length  Line length
  * @param  Color RGB color
  * @retval BSP status
  */
int32_t BSP_LCD_DrawHLine(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Length, uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint16_t xRef = Xpos;
    /* Write line */
    while (Xpos < Length + xRef)
    {
      ret = BSP_LCD_WritePixel(Instance, Xpos++, Ypos, Color);
    }
  }
  return ret;
}

/**
  * @brief  Draws a vertical line in currently active layer.
  * @param  Instance   LCD Instance
  * @param  Xpos  X position
  * @param  Ypos  Y position
  * @param  Length  Line length
  * @param  Color RGB color
  * @retval BSP status
  */
int32_t BSP_LCD_DrawVLine(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Length, uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint16_t yRef = Ypos;

    while (Ypos < Length + yRef)
    {
      ret = BSP_LCD_WritePixel(Instance, Xpos, Ypos++, Color);
    }
  }
  return ret;

}

/**
  * @brief  Reads a LCD pixel.
  * @param  Instance    LCD Instance
  * @param  Xpos X position
  * @param  Ypos Y position
  * @param  Color RGB pixel color
  * @retval BSP status
  */
int32_t BSP_LCD_ReadPixel(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t *Color)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t LCDPixelFormat;
    BSP_LCD_GetPixelFormat(Instance, &LCDPixelFormat);

    if (LCDPixelFormat == LCD_PIXEL_FORMAT_RGB565)
    {
      /* Read data value from RAM memory */
      *Color = *(__IO uint16_t *)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress +
                                  (2 * (Ypos * (hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth) + Xpos)));
    }
    else if (LCDPixelFormat == LCD_PIXEL_FORMAT_ARGB8888)
    {
      /* Read data value from RAM memory */
      *Color = *(__IO uint32_t *)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress +
                                  (4 * (Ypos * (hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth) + Xpos)));
    }
  }
  return ret;
}
/**
  * @brief  Draws a pixel on LCD.
  * @param  Instance LCD Instance
  * @param  Xpos X position
  * @param  Ypos Y position
  * @param  RGB_Code Pixel color
  * @retval BSP status
  */
int32_t BSP_LCD_WritePixel(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t RGB_Code)
{
  int32_t ret = BSP_ERROR_NONE;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t LCDPixelFormat;
    BSP_LCD_GetPixelFormat(Instance, &LCDPixelFormat);
    /* Write data value to all SDRAM memory */
    if (LCDPixelFormat == LCD_PIXEL_FORMAT_RGB565)
    {
      /* RGB565 format */
      *(__IO uint16_t *)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + \
                         (2 * (Ypos * (hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth) + Xpos))) = (uint16_t)RGB_Code;
    }
    else if (LCDPixelFormat == LCD_PIXEL_FORMAT_ARGB8888)
    {
      /* ARGB8888 format */
      *(__IO uint32_t *)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + \
                         (4 * (Ypos * (hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth) + Xpos))) = RGB_Code;
    }
  }
  return ret;
}

/**
  * @brief  Draws a bitmap picture loaded in the internal Flash in currently active layer.
  * @param  Instance LCD Instance
  * @param  Xpos Bmp X position in the LCD
  * @param  Ypos Bmp Y position in the LCD
  * @param  pBmp Pointer to Bmp picture address in the internal Flash.
  * @retval BSP status
  */
int32_t BSP_LCD_DrawBitmap(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint8_t *pBmp)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint32_t index;
    uint32_t width;
    uint32_t height;
    uint32_t bit_pixel;
    uint32_t StartAddress;
    uint32_t xStartAddress;
    uint32_t input_color_mode;

    /* Get bitmap data address offset */
    index = (uint32_t)pBmp[10] + ((uint32_t)pBmp[11] << 8) + ((uint32_t)pBmp[12] << 16)  + ((uint32_t)pBmp[13] << 24);

    /* Read bitmap width */
    width = (uint32_t)pBmp[18] + ((uint32_t)pBmp[19] << 8) + ((uint32_t)pBmp[20] << 16)  + ((uint32_t)pBmp[21] << 24);

    /* Read bitmap height */
    height = (uint32_t)pBmp[22] + ((uint32_t)pBmp[23] << 8) + ((uint32_t)pBmp[24] << 16)  + ((uint32_t)pBmp[25] << 24);

    /* Read bit/pixel */
    bit_pixel = (uint32_t)pBmp[28] + ((uint32_t)pBmp[29] << 8);


    /* Get the layer pixel format */
    if ((bit_pixel / 8U) == 2U)
    {
      input_color_mode = LCD_PIXEL_FORMAT_RGB565;
      /* Set the address */
      StartAddress = (hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress);
      StartAddress = StartAddress + (2 * (Ypos * (hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth) + Xpos));
    }
    else if ((bit_pixel / 8U) == 4U)
    {
      input_color_mode = LCD_PIXEL_FORMAT_ARGB8888;
      /* Set the address */
      StartAddress = (hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress);
      StartAddress = StartAddress + (4 * (Ypos * (hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth) + Xpos));
    }


    /*Read the Pixel*/
    uint32_t size =  width * height;
    Pixel_t pixels[MAX_PIXEL_SIZE];
    uint16_t i;

    for (i = 0; i < size; i++)
    {
      if (input_color_mode == LCD_PIXEL_FORMAT_RGB565)
      {
        uint16_t temp_pixel = (pBmp[index + i * 2 + 1] << 8) | pBmp[index + i * 2];
        pixels[i].red = (temp_pixel & 0xF800) >> 8;
        pixels[i].green = (temp_pixel & 0x07E0) >> 3;
        pixels[i].blue = (temp_pixel & 0x001F) << 3;
      }
      else if (input_color_mode == LCD_PIXEL_FORMAT_ARGB8888)
      {
        uint32_t temp_pixel = (pBmp[index + i * 4 + 3] << 24) | (pBmp[index + i * 4 + 2] << 16) |
                              (pBmp[index + i * 4 + 1] << 8) | pBmp[index + i * 4];
        pixels[i].alpha = (temp_pixel & 0xFF000000) >> 24 ;
        pixels[i].red = (temp_pixel & 0x00FF0000) >> 16;
        pixels[i].green = (temp_pixel & 0x0000FF00) >> 8;
        pixels[i].blue = temp_pixel & 0x000000FF;
      }
    }

    /* Write the pixel data to the display */
    if (input_color_mode == LCD_PIXEL_FORMAT_RGB565)
    {
      int16_t y;
      int16_t x;
      for (y = height - 1; y >= 0; y--)
      {
        xStartAddress = StartAddress;
        for (x = 0; x < width; x++)
        {
          uint16_t rgbCode;
          rgbCode = ((pixels[y * width + x].red & 0xF8) << 8) |
                    ((pixels[y * width + x].green & 0xFC) << 3) |
                    (pixels[y * width + x].blue >> 3);


          *(__IO uint16_t *)(xStartAddress) = rgbCode;
          xStartAddress += 2U;
        }
        StartAddress += hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth * 2;
      }
    }
    else if ((input_color_mode == LCD_PIXEL_FORMAT_ARGB8888))
    {
      int32_t y;
      int32_t x;
      for (y = height - 1; y >= 0; y--)
      {
        xStartAddress = StartAddress;
        for (x = 0; x < width; x++)
        {
          uint32_t argbCode;
          argbCode = (pixels[y * width + x].alpha << 24) |
                     (pixels[y * width + x].red << 16) |
                     (pixels[y * width + x].green << 8) |
                     pixels[y * width + x].blue;
          *(__IO uint32_t *)(xStartAddress) = argbCode;
          xStartAddress += 4U;
        }
        StartAddress += hLtdcHandler.LayerCfg[ActiveLayer].ImageWidth * 4;
      }
    }
  }
  return ret;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
